app/Exports/StudentsExport.php

select * from "clubs" where "clubs"."id" = 1 and "clubs"."deleted_at" is null limit 1
---
    public function map($student): array
    {
        return [
            ++$this->rowIndex, // Serial number
            $student->id,
            $student->first_name . ' ' . $student->last_name,
            $student->club->name,
            Carbon::parse($student->birthdate)->format('Y/m/d'),
            Carbon::parse($student->birthdate)->age,
            $student->ahzab_up == 0 ? "0" : $student->ahzab_up,
            $student->ahzab_down == 0 ? "0" : $student->ahzab_down,
            $student->ahzab == 0 ? "0" : $student->ahzab,
        ];