app/Http/Controllers/PersonnelController.php

    public function index()
    {
        $personnels = User::withTrashed()->with(['clubs', 'categoryRestrictions'])->latest()->get()->map(function ($user) {
            $lastActivity = Activity::where('causer_id', $user->id)
                ->where('causer_type', User::class)
                ->latest()
                ->first();

            $user->last_activity_at = $lastActivity ? $lastActivity->created_at->toISOString() : null;

            return $user;
        });
---
select "clubs".*, "club_user"."user_id" as "pivot_user_id", "club_user"."club_id" as "pivot_club_id" from "clubs" inner join "club_user" on "clubs"."id" = "club_user"."club_id" where "club_user"."user_id" in (1) and "clubs"."deleted_at" is null
select * from "users" where "users"."deleted_at" is null order by "created_at" desc