app/Http/Controllers/StudentResourceController.php

            $student->name = $student->first_name.' '.$student->last_name;
            $birthdate = Carbon::parse($student->birthdate);
            $student->age = (int) $birthdate->diffInYears(Carbon::now());
            $student->club = Club::find($student->club_id)->name;
            $category = Category::find($student->category_id);
---
select * from "clubs" where "clubs"."id" = 1 and "clubs"."deleted_at" is null limit 1
select * from "categories" where "categories"."id" = 5 and "categories"."deleted_at" is null limit 1