app/Http/Controllers/StudentResourceController.php

            $student->name = $student->first_name . ' ' . $student->last_name;
            $birthdate = Carbon::parse($student->birthdate);
            $student->age = (int) $birthdate->diffInYears(Carbon::now());
            $student->club = Club::find($student->club_id)->name;
            $category = Category::find($student->category_id);
---
select * from "clubs" where "clubs"."id" = 6 and "clubs"."deleted_at" is null limit 1
select * from "categories" where "categories"."id" = 6 and "categories"."deleted_at" is null limit 1

        });

        // Adjust the counts for gender and categories based on accessible clubs
        $genderCounts = Student::select('gender', DB::raw('count(*) as total'))
            ->whereIn('club_id', $accessibleClubs)
            ->groupBy('gender')->get();

        $categoryCounts = Category::withCount(['students' => function ($query) use ($accessibleClubs) {
            $query->whereIn('club_id', $accessibleClubs);
        }])->get();

        $clubCounts = Club::withCount(['students' => function ($query) use ($accessibleClubs) {
            $query->whereIn('club_id', $accessibleClubs);
        }])->whereIn('id', $accessibleClubs)->get();
---
select "gender", count(*) as total from "students" where "club_id" in (1, 2, 3, 4, 5, 6) and "students"."deleted_at" is null group by "gender"
select count(*) as aggregate from "students" where "club_id" in (1, 2, 3, 4, 5, 6) and "gender" in ('female') and "category_id" in ('4', '8', '6', '1') and "students"."deleted_at" is null
select * from "clubs" where "clubs"."id" = 4 and "clubs"."deleted_at" is null limit 1
select count(*) as aggregate from "students" where "club_id" in (1, 2, 3, 4, 5, 6) and "students"."deleted_at" is null

    public function show(string $id)
    {
        $student = Student::find($id)->load('club', 'category', 'father', 'mother');
---
select * from "categories" where "categories"."id" in (2) and "categories"."deleted_at" is null
select * from "clubs" where "clubs"."id" in (2) and "clubs"."deleted_at" is null
select * from "students" where "students"."id" = '457' and "students"."deleted_at" is null limit 1

    public function edit(string $id)
    {
        $student = Student::find($id)->load('father', 'mother');
        $siblings = $student->getSiblings();

        return Inertia::render(
            'Dashboard/Students/Update',
            [
                'student' => $student,
                'siblings' => $siblings,
                'clubs' => Auth::user()->accessibleClubs(),
                'categories' => Category::all()
            ]
        );
---
select * from "categories" where "categories"."deleted_at" is null