app/Http/Controllers/StudentResourceController.php

select "gender", count(*) as total from "students" where "club_id" in (1, 2, 3, 4, 5, 6) and "students"."deleted_at" is null group by "gender"
---
    public function index(Request $request)
    {
        $query = Student::query();

        if ($search = $request->input('search')) {
            $query->whereRaw("(first_name || ' ' || last_name) like ?", ["%{$search}%"])
                ->orWhereRaw("(last_name || ' ' || first_name) like ?", ["%{$search}%"]);
        }

        // Retrieve sorting parameters from the request
        $sortBy = $request->input('sortBy', 'created_at'); // Default to 'created_at'
        $sortType = $request->input('sortType', 'desc'); // Default to 'desc'

        if ($sortBy === 'name') {
            $query->orderBy('first_name', $sortType)->orderBy('last_name', $sortType);
        } else {
            $query->orderBy($sortBy, $sortType);
        }

        // Apply sorting to the query
        $query->orderBy($sortBy, $sortType);

        $students = $query->paginate(10, ['id', 'first_name', 'last_name', 'birthdate', 'ahzab', 'gender', 'insurance_expire_at', 'subscription', 'subscription_expire_at', 'id_club', 'id_category'])->withQueryString();

select * from "students" where "club_id" in (1, 2, 3, 4, 5, 6) and "students"."deleted_at" is null
---
    public function edit(string $id)
    {
        return Inertia::render(
            'Dashboard/Students/Update',
            [
                'student' => Student::find($id),
                'clubs' => Club::all(),
                'categories' => Category::all()
            ]
        );