app/Models/Student.php

    public function getSiblings()
    {
        // Get the father's and mother's phone numbers
        $fatherPhone = $this->father ? $this->father->phone : null;
        $motherPhone = $this->mother ? $this->mother->phone : null;

        $siblings = Student::select('id', 'father_id', 'mother_id', 'first_name', 'last_name', 'gender', 'birthdate', 'subscription', 'ahzab', 'subscription_expire_at', 'category_id')
            ->where('id', '!=', $this->id)
            ->where('club_id', $this->club_id)
            ->where(function ($query) use ($fatherPhone, $motherPhone) {
                if ($fatherPhone) {
                    $query->whereHas('father', function ($query) use ($fatherPhone) {
                        $query->where('phone', $fatherPhone);
                    });
                }
                if ($motherPhone) {
                    $query->orWhereHas('mother', function ($query) use ($motherPhone) {
                        $query->where('phone', $motherPhone);
                    });
                }
            })
            ->with(['category', 'father', 'mother'])
            ->get();
---
select "id", "father_id", "mother_id", "first_name", "last_name", "gender", "birthdate", "subscription", "ahzab", "subscription_expire_at", "category_id" from "students" where "id" != 496 and "club_id" = 1 and (exists (select * from "guardians" where "students"."mother_id" = "guardians"."id" and "phone" = '0673326794')) and "students"."deleted_at" is null