app/Models/User.php

select * from "clubs" where "clubs"."deleted_at" is null
---
    public function accessibleClubs()
    {
        if ($this->role === 'admin') {
            return Club::all();